{"docstore/data":{"./data/Career Journey.pdf_1":{"__data__":"{\"id_\":\"./data/Career Journey.pdf_1\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{},\"text\":\"Sanath’s Career Journey\\r\\nMy passion towards computer science started when I was building a website as part of an assignment in \\r\\nYear 12. Even though I had average grades in all the science subjects, my computer science marks were \\r\\nalways impressive to me. Working on school assignments or any personal projects I started noticing that I \\r\\nwas spending a great amount of time working under the hood to make sure the application worked correctly. \\r\\nThis made me realise that unconsciously I was curious about in-dept working of programming languages \\r\\nsuch as JavaScript, HTML, CSS, and C++. Also the efficiency of learning one object oriented programming \\r\\nlanguage made it to understand and learn others. \\r\\nWith this curiosity and advice from elders, I felt that computer science would be a booming topic in coming \\r\\nyears. Well looking back at that though in 2024 I feel computer science is not only booming but getting out of \\r\\nhands. Getting admitted in to one of the prestigious universities in India which is Christ University, I felt really \\r\\ngrateful for this opportunity. At the beginning of my Bachelor’s of Engineering course with a computer science\\r\\nmajor I felt really enthusiastic as I was learning what I loved. Concepts in Engineering Maths were pretty \\r\\nchallenging but I always gave extra effort to learn about the application in which we can implement these \\r\\nmathematical techniques and theorems. Doing a major in computer science I was thought the theoretical \\r\\nsubject such as Database Management, Software Engineering, Data Structures and Algorithm, Internet of \\r\\nThings and other various subjects which improved my problem solving skills. The theoretical knowledge gave\\r\\nme a boot in building robust applications and provide a strong foundational code to the applications. \\r\\nIn my third year of Engineering I published a research paper titled “Secure Bitcoin Transaction and IoT \\r\\ndevice usage in Decentralized Application.” [Learn more about my research here: \\r\\nhttps://ieeexplore.ieee.org/abstract/document/8724077  ]  . With the help of my professor I was able to \\r\\ncomplete my research and put all my thoughts in a paper. Based on the research I also was able to develop \\r\\na working prototype for my final year bachelor’s project which was worth 50 credits. In this project I \\r\\ndeveloped a smart door lock system which used blockchain technology as a security feature to handle \\r\\nmalicious activities. During this process I learnt a lot about doing a market study or reviewing past research \\r\\npapers and the writing skills required to put my thoughts in a paper. Documentation is an important skill \\r\\nwhich is required for a software developer or a software engineer or any other technical career fields.\\r\\nApart from university’s assignments and projects I was involved in learning latest cutting edge technologies \\r\\nand tools such as Laravel Framework, Django Framework, MongoDB, ReactJS Library and various other \\r\\nweb development tools and framework. I was always wanted to create something cool using the new tools. \\r\\nThis curiosity of exploring latest tools and languages still remains in me. One such project I build which I am \\r\\nproud of today is smart stick for blind people, I used my IoT and software development skills to build a tool \\r\\nwhich helps blind people to navigate in public places such as a railway station, airport and bus stations.\\r\\nAfter graduating my bachelor’s degree with a GPA of 8.09 out of 10. I started working as a volunteer Data \\r\\nAnalyst at one of the non government organisation to help rural communities to sustainable electricity and \\r\\nwater. I was working on various geospatial data provided by the government. I used various data cleaning \\r\\nand pre-processing techniques on a geospatial dataset to analyze renewable energy resources used in \\r\\nIndia's rural areas and designed a map utilizing Map box tool and JavaScript for visualizing the analysis. I \\r\\nworked on the following at BR & UD Trust (Non Government Organisation):\\r\\n•Used various data cleaning and pre-processing techniques on a geospatial dataset to analyze \\r\\nrenewable energy resources used in India's rural areas and designed a map utilizing Map box tool \\r\\nand JavaScript for visualizing the analysis.\\r\\n•Reduced dimensionality of Geo-Spatial dataset to perform better visualizations of data.\\r\\n•Programming Languages and Tools used: Tableau, Map Box, Python, JavaScript. \\r\\nAfter receiving a offer letter with a scholarship from University of Melbourne, I decided to study in Australia \\r\\nand improve my knowledge in computer science. I think a masters was necessary for me explore my interest\\r\\nin computer science in a broader perspective.\\r\\nDuring my Masters of Computer science degree in University of Melbourne, I took up subjects such as \\r\\nsoftware testing, web security, advanced database management, distributed computing, machine learning \\r\\nand others. I really enjoyed learning web security, software testing and distributed computing subjects as it \\r\\n\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"DOCUMENT\",\"hash\":\"j7uhbOxjsyJ18KRZsbqFwDMcFrTn6fSR+dE5Yu9ov9M=\"}","__type__":"DOCUMENT"},"./data/Career Journey.pdf_2":{"__data__":"{\"id_\":\"./data/Career Journey.pdf_2\",\"metadata\":{\"page_number\":2,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{},\"text\":\"\\r\\ngave me broader knowledge and make my decision making skills better when writing clean code by using \\r\\nbest practices. I completed my masters degree by doing a research on Detection of Deepfake video and its \\r\\neffect on social media platforms. I received an overall VAM of 74 which is an equal GPA of 8.5 out 10. \\r\\nAfter my Masters, I was very grateful to have joined a start-up in Melbourne called Blue Square Tech \\r\\nSolutions. Working as a software developer I learnt a lot from my team lead and other colleagues. I faced a \\r\\nreality check that how problems and challenge differ when working on an assignment and working in a start-\\r\\nup company is. Amazed by pace of learning in an start-up industry I quickly picked up the pace to learn new \\r\\ncloud technologies and other devOps software tools to handle requirements of various clients. I worked on \\r\\nthe following. \\r\\n•Fixed Bugs and built various front-end components in a Scrum environment for the company \\r\\nwebsite. \\r\\n•Created a secured room booking platform for a client using WordPress and an existing plugin. Also \\r\\nmodified the plugin to fulfill the client's requirements by writing PHP scripts. \\r\\n•Languages and tools used: JavaScript, NextJS framework, WordPress, MongoDB. \\r\\nI also learnt more about client handling and how a system development life cycle works. Having gained a \\r\\ngreat knowledge of on how a services based technological industry works.\\r\\nIn the same year I moved on to work as a Graduate software engineer in one the prestigious consulting firm \\r\\nin Australia called AMOG consulting. I was working with a small team and contributing to the development of \\r\\ntwo different existing projects in the firm. The tasks assigned was quite challenging, as I was involved in \\r\\nlearning out of my comfort zone.  The follwing or a details on what I worked on during my time at AMOG \\r\\nConsulting.\\r\\n•Worked on enhancing and developing new functionalities for a Smart Mooring Integrity Checker web \\r\\napplication using ReactJS framework (Front-End) and Flask Framework (Back-End), following SDLC\\r\\n(Software Development Life Cycle) process. \\r\\n•Created multiple React components to visualize raw data and pre-processed data (Oceanic data). \\r\\nAlso created Flask-RESTful APIs at the backend to connect to Postgre SQL database tables in the \\r\\nserver. \\r\\n•Improved the dashboard visualization and end-user performance by using various ReactJS and \\r\\nFlask functionalities. \\r\\n•Integrated Azure Active Directory with the application and created a Single Sign On feature that \\r\\nhelped potential clients interact with the application securely. \\r\\n•Identified critical vulnerabilities in the web application by performing Static Application Security \\r\\nTesting and created a vulnerability assessment report. Improved the path coverage to 100% using \\r\\nmultiple analysis tools and writing pre-defined syntax rules. \\r\\n•Used supervised anomaly detection to identify the failure points on raw sensor data. \\r\\n•Created python-based unit tests for various Flask API endpoints and 90% code coverage rate. \\r\\n•Used tools and programming languages such as: Python, JavaScript, Docker, Azure, GitLab, \\r\\nPostGre SQL. \\r\\n•Developed new features for the company's internal performance management application in a scrum\\r\\nenvironment using CodeIgniter (PHP) Framework.\\r\\n•Created a search feature using server-side processing to view a large amount of data from MySQL \\r\\ndatabase tables. Improved the search functionality by using query optimization techniques. \\r\\n•Created view and edit features for multiple data types from the database tables using dynamic \\r\\nmodels for an MVC view. \\r\\nAfter working with AMOG Consulting for almost an year, I did learn a lot from my seniors. I met the most \\r\\nprofessional people who taught me the important lessons in balancing life with work and also a lesson on \\r\\nhow important it is to work towards my goal rather than thinking about making the right decisions. It is till date\\r\\nthe most memorable place I have worked at. Will cherish all the lessons learnt from the mistakes I have \\r\\nmade in AMOG Consulting.\\r\\nIn the start of 2023 I moved to my home country India, since it was more than 3 years spending my time in \\r\\nAustralia I felt really great to move back and visit my family. Taking a 2 months of career break I worked on \\r\\nmyself by developing my coding skills in c++ and data structures and algorithms by solving leetcode \\r\\nproblems and trying to compete in coding competitions.\\r\\nSince it was getting harder to find jobs due to less opportunities and high competitiveness in the technology \\r\\nindustry I ended up working as a freelance software developer. I acquired two clients in the hospitality sector \\r\\nand was building a full stack applications for both the clients using all the tools I had learnt. However, I saw \\r\\n\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"DOCUMENT\",\"hash\":\"3WmxzvcGbCFjmqoh+BNPX8OLVOFjByyDv7CkmXMZxNE=\"}","__type__":"DOCUMENT"},"./data/Career Journey.pdf_3":{"__data__":"{\"id_\":\"./data/Career Journey.pdf_3\",\"metadata\":{\"page_number\":3,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{},\"text\":\"\\r\\nan opportunity to expand my work towards working on non technical operations in the business of my clients.\\r\\nHence, with the expertise of a business graduate who is my sibling, we both opened a firm called \\r\\nSwamy&Co to help small businesses to improve their operations more robust and scalable in a nature. \\r\\nAfter an year, realising that I need to gain more experiencing and due to various other reasons here I am \\r\\nfinding myself to fit in this unpredictable job market. Yes, I am open for work now. Will be available to join as \\r\\nsoon as possible. Please do let me know if you think I am a good fit at your organisation please send me an \\r\\nemail at sanathkumar5671@gmail.com or call my phone Number +61 432062190.\\r\\n\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"DOCUMENT\",\"hash\":\"nwfpYQXsGhRQsfTrxfXZjOVm6AlSRUJRHqM9/UrdAUg=\"}","__type__":"DOCUMENT"},"./data/Career Journey.pdf_4":{"__data__":"{\"id_\":\"./data/Career Journey.pdf_4\",\"metadata\":{\"page_number\":4,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{},\"text\":\"\\r\\n\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"DOCUMENT\",\"hash\":\"E4DK+l2P7nvw5uqGFI76nawW8ADkXSvaL72FFLQSAZs=\"}","__type__":"DOCUMENT"},"./data/Resume - Sanathkumar A Swamy.pdf_1":{"__data__":"{\"id_\":\"./data/Resume - Sanathkumar A Swamy.pdf_1\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Resume - Sanathkumar A Swamy.pdf\",\"file_name\":\"Resume - Sanathkumar A Swamy.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{},\"text\":\"Address: 1 Miranda Close, Clayton South VIC 3169                                                                            GitHub: https://github.com/sanathkumar5671\\r\\nPhone No: +61 432062190                                                                                 LinkedIn: https://www.linkedin.com/in/sanathkumar-a-990549136\\r\\nEmail Id:sanathkumar5671@gmail.com                                                                                        Personal Website: https://sanathkumar.netlify.app\\r\\nSanathkumar A Swamy\\r\\nPERSONAL STATEMENT\\r\\nA   passionate   and   detail-oriented   computer   science   graduate   with   a   strong   academic   foundation   and   two   years   of\\r\\nprofessional experience as a software development engineer. Proficient in a wide range of programming languages and\\r\\ntechnologies, with a focus on  efficient and secure coding practices, effective interpersonal communication skills and\\r\\nbuilding scalable & robust application  .   Eager   to   leverage   my   problem   solving   skills   to   contribute   to   an   innovative\\r\\norganization's growth and success.\\r\\nSKILLS\\r\\nProgramming Languages: (Expert) Python, Javascript (Intermediate) PHP, Structured Query Language (SQL), (beginner) C++\\r\\nDevelopment Tools:  (Expert) React.js, (Intermediate) HTML, CSS, Node.js, Express.js, CodeIgniter, Django, Docker,\\r\\nNginx, Microsoft Azure, Git, MongoDB, MySql, PostreSQL, HTTP, RESTful API, Postgres, React and Redux, jquery\\r\\nDevelopment Methodologies: System Development Life Cycle, Agile, Jira, Git, Confluence\\r\\nSoft Skills: Problem Solving, Collaboration, Communication, Proactivity\\r\\nEXPERIENCE\\r\\nCo-Founder | Swamy&Co                                                         February 2023 -  March 2024\\r\\n•Acquired 2 clients from hospitality sector within the first six months of launching a consulting firm called Swamy&Co.\\r\\n•Developing innovative solutions to address market needs or challenges faced by the clients. Implementing  efficient\\r\\ntechnologies to streamline operations and drive growth for our clients.\\r\\n•Collaborated with the clients to understand their challenges and devise a tailored solution. Utilized MERN stack and\\r\\nLaravel to build a scalable and efficient system capable of handling increased user demand.\\r\\n•Implemented financial management features resulting in a 10% reduction in monthly losses for the clients.\\r\\nSoftware Development Engineer | AMOG Consulting                                                        March 2022 – December 2022\\r\\nSmart Mooring Integrity Checker (Single-page web application)\\r\\n•Led the enhancement and implementation of features to the highly scalable and responsive web application. \\r\\n•Achieved a 20% improvement in user experience and a 90% positive client rating.\\r\\n•Integrated UI with Azure Active Directory cloud services, implementing Single Sign On (OAuth2.0 and OpenID) for\\r\\nsecure client/user interaction.\\r\\n•Conducted rigorous static application security testing, addressing critical vulnerabilities and improving application\\r\\nsecurity by 100%.\\r\\n•Implemented comprehensive unit testing strategies for diverse backend components of the application, ensuring 100%\\r\\ncode coverage through proficient utilization of pytest (python automation).\\r\\n•Collaborated in an  Agile  environment, developing features for the company’s performance management application\\r\\nusing CodeIgniter (PHP) and MySQL (SQL).\\r\\nSoftware Developer | Blue Square Tech Solutions                                    December 2021 -  March 2022\\r\\n•Enhanced and implemented features for the company’s WordPress-based website, effectively utilizing WordPress and\\r\\nReact.js (Javascript). \\r\\n•Designed and Developed a secure room booking platform using WordPress and Express.js (Javascript), customizing\\r\\nWordPress plugins based on client system requirements.\\r\\n•Utilized strong interpersonal skills to communicate with clients, categorize customer issues using Jira Software, and\\r\\ndevise effective solutions.\\r\\n•Documented design and planning using Confluence to ensure project execution.\\r\\nEDUCATION\\r\\nThe University of Melbourne | Master of Computer Science                                                    March 2020 – December 2021\\r\\nWAM – 74/100                                                                                                                                                  \\r\\nChrist University | Bachelors of Technology in Computer Science                                             June 2015 – May 2019\\r\\nGPA – 8.09/10\\r\\nAWARDS & CERTIFICATES\\r\\n•Award: Melbourne School of Engineering Scholarship [AUD$5000].\\r\\n•Publication:Secure Bitcoin Transaction and IoT Device usage in Decentralized Application.\\r\\n\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"DOCUMENT\",\"hash\":\"s3LLFkFS2PHNoDeNQgC9SHoD+b7qESc1hUBpSkrj6cA=\"}","__type__":"DOCUMENT"},"./data/Resume - Sanathkumar A Swamy.pdf_2":{"__data__":"{\"id_\":\"./data/Resume - Sanathkumar A Swamy.pdf_2\",\"metadata\":{\"page_number\":2,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Resume - Sanathkumar A Swamy.pdf\",\"file_name\":\"Resume - Sanathkumar A Swamy.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{},\"text\":\"\\r\\n\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"DOCUMENT\",\"hash\":\"E4DK+l2P7nvw5uqGFI76nawW8ADkXSvaL72FFLQSAZs=\"}","__type__":"DOCUMENT"},"1aa7fd63-b1b7-4035-bfb2-b93d38b1c09a":{"__data__":"{\"id_\":\"1aa7fd63-b1b7-4035-bfb2-b93d38b1c09a\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{\"SOURCE\":{\"nodeId\":\"./data/Career Journey.pdf_1\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"hash\":\"j7uhbOxjsyJ18KRZsbqFwDMcFrTn6fSR+dE5Yu9ov9M=\"},\"NEXT\":{\"nodeId\":\"f945dc0c-91ec-4b51-8c1a-55ab2f644128\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"hash\":\"Saa6/wdrMZ9+a5Us7xyB2cHpxISZ+EVeI5Fcbo8Cg44=\"}},\"text\":\"Sanath’s Career Journey\\r\\nMy passion towards computer science started when I was building a website as part of an assignment in \\r\\nYear 12. Even though I had average grades in all the science subjects, my computer science marks were \\r\\nalways impressive to me. Working on school assignments or any personal projects I started noticing that I \\r\\nwas spending a great amount of time working under the hood to make sure the application worked correctly. This made me realise that unconsciously I was curious about in-dept working of programming languages \\r\\nsuch as JavaScript, HTML, CSS, and C++. Also the efficiency of learning one object oriented programming \\r\\nlanguage made it to understand and learn others. With this curiosity and advice from elders, I felt that computer science would be a booming topic in coming \\r\\nyears. Well looking back at that though in 2024 I feel computer science is not only booming but getting out of \\r\\nhands. Getting admitted in to one of the prestigious universities in India which is Christ University, I felt really \\r\\ngrateful for this opportunity. At the beginning of my Bachelor’s of Engineering course with a computer science\\r\\nmajor I felt really enthusiastic as I was learning what I loved. Concepts in Engineering Maths were pretty \\r\\nchallenging but I always gave extra effort to learn about the application in which we can implement these \\r\\nmathematical techniques and theorems. Doing a major in computer science I was thought the theoretical \\r\\nsubject such as Database Management, Software Engineering, Data Structures and Algorithm, Internet of \\r\\nThings and other various subjects which improved my problem solving skills. The theoretical knowledge gave\\r\\nme a boot in building robust applications and provide a strong foundational code to the applications. In my third year of Engineering I published a research paper titled “Secure Bitcoin Transaction and IoT \\r\\ndevice usage in Decentralized Application. ” [Learn more about my research here: \\r\\nhttps://ieeexplore.ieee.org/abstract/document/8724077  ]  . With the help of my professor I was able to \\r\\ncomplete my research and put all my thoughts in a paper. Based on the research I also was able to develop \\r\\na working prototype for my final year bachelor’s project which was worth 50 credits. In this project I \\r\\ndeveloped a smart door lock system which used blockchain technology as a security feature to handle \\r\\nmalicious activities.\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"TEXT\",\"hash\":\"3Z9rYmSC9L5bVd72O27pzEkNF/MLdNoB4W7a9qFQ4bg=\"}","__type__":"TEXT"},"f945dc0c-91ec-4b51-8c1a-55ab2f644128":{"__data__":"{\"id_\":\"f945dc0c-91ec-4b51-8c1a-55ab2f644128\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{\"SOURCE\":{\"nodeId\":\"./data/Career Journey.pdf_1\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"hash\":\"j7uhbOxjsyJ18KRZsbqFwDMcFrTn6fSR+dE5Yu9ov9M=\"},\"PREVIOUS\":{\"nodeId\":\"1aa7fd63-b1b7-4035-bfb2-b93d38b1c09a\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"hash\":\"3Z9rYmSC9L5bVd72O27pzEkNF/MLdNoB4W7a9qFQ4bg=\"}},\"text\":\"During this process I learnt a lot about doing a market study or reviewing past research \\r\\npapers and the writing skills required to put my thoughts in a paper. Documentation is an important skill \\r\\nwhich is required for a software developer or a software engineer or any other technical career fields. Apart from university’s assignments and projects I was involved in learning latest cutting edge technologies \\r\\nand tools such as Laravel Framework, Django Framework, MongoDB, ReactJS Library and various other \\r\\nweb development tools and framework. I was always wanted to create something cool using the new tools. This curiosity of exploring latest tools and languages still remains in me. One such project I build which I am \\r\\nproud of today is smart stick for blind people, I used my IoT and software development skills to build a tool \\r\\nwhich helps blind people to navigate in public places such as a railway station, airport and bus stations. After graduating my bachelor’s degree with a GPA of 8.09 out of 10. I started working as a volunteer Data \\r\\nAnalyst at one of the non government organisation to help rural communities to sustainable electricity and \\r\\nwater. I was working on various geospatial data provided by the government. I used various data cleaning \\r\\nand pre-processing techniques on a geospatial dataset to analyze renewable energy resources used in \\r\\nIndia's rural areas and designed a map utilizing Map box tool and JavaScript for visualizing the analysis. I \\r\\nworked on the following at BR & UD Trust (Non Government Organisation):\\r\\n•Used various data cleaning and pre-processing techniques on a geospatial dataset to analyze \\r\\nrenewable energy resources used in India's rural areas and designed a map utilizing Map box tool \\r\\nand JavaScript for visualizing the analysis. •Reduced dimensionality of Geo-Spatial dataset to perform better visualizations of data. •Programming Languages and Tools used: Tableau, Map Box, Python, JavaScript. After receiving a offer letter with a scholarship from University of Melbourne, I decided to study in Australia \\r\\nand improve my knowledge in computer science. I think a masters was necessary for me explore my interest\\r\\nin computer science in a broader perspective. During my Masters of Computer science degree in University of Melbourne, I took up subjects such as \\r\\nsoftware testing, web security, advanced database management, distributed computing, machine learning \\r\\nand others. I really enjoyed learning web security, software testing and distributed computing subjects as it\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"TEXT\",\"hash\":\"Saa6/wdrMZ9+a5Us7xyB2cHpxISZ+EVeI5Fcbo8Cg44=\"}","__type__":"TEXT"},"e68151cb-1131-4cfb-b5b7-8a5f599a0eba":{"__data__":"{\"id_\":\"e68151cb-1131-4cfb-b5b7-8a5f599a0eba\",\"metadata\":{\"page_number\":2,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{\"SOURCE\":{\"nodeId\":\"./data/Career Journey.pdf_2\",\"metadata\":{\"page_number\":2,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"hash\":\"3WmxzvcGbCFjmqoh+BNPX8OLVOFjByyDv7CkmXMZxNE=\"},\"NEXT\":{\"nodeId\":\"91ba3142-d732-4177-ab3d-e92c83ce1801\",\"metadata\":{\"page_number\":2,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"hash\":\"69UliaWNBfErvUkMOg3aaj5VMg7Y4C+j5pDfKV2Q9IM=\"}},\"text\":\"gave me broader knowledge and make my decision making skills better when writing clean code by using \\r\\nbest practices. I completed my masters degree by doing a research on Detection of Deepfake video and its \\r\\neffect on social media platforms. I received an overall VAM of 74 which is an equal GPA of 8.5 out 10. After my Masters, I was very grateful to have joined a start-up in Melbourne called Blue Square Tech \\r\\nSolutions. Working as a software developer I learnt a lot from my team lead and other colleagues. I faced a \\r\\nreality check that how problems and challenge differ when working on an assignment and working in a start-\\r\\nup company is. Amazed by pace of learning in an start-up industry I quickly picked up the pace to learn new \\r\\ncloud technologies and other devOps software tools to handle requirements of various clients. I worked on \\r\\nthe following. •Fixed Bugs and built various front-end components in a Scrum environment for the company \\r\\nwebsite. •Created a secured room booking platform for a client using WordPress and an existing plugin. Also \\r\\nmodified the plugin to fulfill the client's requirements by writing PHP scripts. •Languages and tools used: JavaScript, NextJS framework, WordPress, MongoDB. I also learnt more about client handling and how a system development life cycle works. Having gained a \\r\\ngreat knowledge of on how a services based technological industry works. In the same year I moved on to work as a Graduate software engineer in one the prestigious consulting firm \\r\\nin Australia called AMOG consulting. I was working with a small team and contributing to the development of \\r\\ntwo different existing projects in the firm. The tasks assigned was quite challenging, as I was involved in \\r\\nlearning out of my comfort zone. The follwing or a details on what I worked on during my time at AMOG \\r\\nConsulting. •Worked on enhancing and developing new functionalities for a Smart Mooring Integrity Checker web \\r\\napplication using ReactJS framework (Front-End) and Flask Framework (Back-End), following SDLC\\r\\n(Software Development Life Cycle) process. •Created multiple React components to visualize raw data and pre-processed data (Oceanic data). Also created Flask-RESTful APIs at the backend to connect to Postgre SQL database tables in the \\r\\nserver. •Improved the dashboard visualization and end-user performance by using various ReactJS and \\r\\nFlask functionalities.\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"TEXT\",\"hash\":\"bwAyURsUz67i3EShJ8u+OxaYt5zUBFllYRnOcf8ynAU=\"}","__type__":"TEXT"},"91ba3142-d732-4177-ab3d-e92c83ce1801":{"__data__":"{\"id_\":\"91ba3142-d732-4177-ab3d-e92c83ce1801\",\"metadata\":{\"page_number\":2,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{\"SOURCE\":{\"nodeId\":\"./data/Career Journey.pdf_2\",\"metadata\":{\"page_number\":2,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"hash\":\"3WmxzvcGbCFjmqoh+BNPX8OLVOFjByyDv7CkmXMZxNE=\"},\"PREVIOUS\":{\"nodeId\":\"e68151cb-1131-4cfb-b5b7-8a5f599a0eba\",\"metadata\":{\"page_number\":2,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"hash\":\"bwAyURsUz67i3EShJ8u+OxaYt5zUBFllYRnOcf8ynAU=\"}},\"text\":\"•Improved the dashboard visualization and end-user performance by using various ReactJS and \\r\\nFlask functionalities. •Integrated Azure Active Directory with the application and created a Single Sign On feature that \\r\\nhelped potential clients interact with the application securely. •Identified critical vulnerabilities in the web application by performing Static Application Security \\r\\nTesting and created a vulnerability assessment report. Improved the path coverage to 100% using \\r\\nmultiple analysis tools and writing pre-defined syntax rules. •Used supervised anomaly detection to identify the failure points on raw sensor data. •Created python-based unit tests for various Flask API endpoints and 90% code coverage rate. •Used tools and programming languages such as: Python, JavaScript, Docker, Azure, GitLab, \\r\\nPostGre SQL. •Developed new features for the company's internal performance management application in a scrum\\r\\nenvironment using CodeIgniter (PHP) Framework. •Created a search feature using server-side processing to view a large amount of data from MySQL \\r\\ndatabase tables. Improved the search functionality by using query optimization techniques. •Created view and edit features for multiple data types from the database tables using dynamic \\r\\nmodels for an MVC view. After working with AMOG Consulting for almost an year, I did learn a lot from my seniors. I met the most \\r\\nprofessional people who taught me the important lessons in balancing life with work and also a lesson on \\r\\nhow important it is to work towards my goal rather than thinking about making the right decisions. It is till date\\r\\nthe most memorable place I have worked at. Will cherish all the lessons learnt from the mistakes I have \\r\\nmade in AMOG Consulting. In the start of 2023 I moved to my home country India, since it was more than 3 years spending my time in \\r\\nAustralia I felt really great to move back and visit my family. Taking a 2 months of career break I worked on \\r\\nmyself by developing my coding skills in c++ and data structures and algorithms by solving leetcode \\r\\nproblems and trying to compete in coding competitions. Since it was getting harder to find jobs due to less opportunities and high competitiveness in the technology \\r\\nindustry I ended up working as a freelance software developer. I acquired two clients in the hospitality sector \\r\\nand was building a full stack applications for both the clients using all the tools I had learnt. However, I saw\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"TEXT\",\"hash\":\"69UliaWNBfErvUkMOg3aaj5VMg7Y4C+j5pDfKV2Q9IM=\"}","__type__":"TEXT"},"79a03803-3457-43cc-839c-516925f67207":{"__data__":"{\"id_\":\"79a03803-3457-43cc-839c-516925f67207\",\"metadata\":{\"page_number\":3,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{\"SOURCE\":{\"nodeId\":\"./data/Career Journey.pdf_3\",\"metadata\":{\"page_number\":3,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Career Journey.pdf\",\"file_name\":\"Career Journey.pdf\"},\"hash\":\"nwfpYQXsGhRQsfTrxfXZjOVm6AlSRUJRHqM9/UrdAUg=\"}},\"text\":\"an opportunity to expand my work towards working on non technical operations in the business of my clients. Hence, with the expertise of a business graduate who is my sibling, we both opened a firm called \\r\\nSwamy&Co to help small businesses to improve their operations more robust and scalable in a nature. After an year, realising that I need to gain more experiencing and due to various other reasons here I am \\r\\nfinding myself to fit in this unpredictable job market. Yes, I am open for work now. Will be available to join as \\r\\nsoon as possible. Please do let me know if you think I am a good fit at your organisation please send me an \\r\\nemail at sanathkumar5671@gmail.com or call my phone Number +61 432062190.\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"TEXT\",\"hash\":\"DYhUAByXv1tA3rboDDBiVFX+z0y3Rv39RI7l8Y/j4lQ=\"}","__type__":"TEXT"},"17882b56-8ce6-4cb7-bc95-d197f2b40962":{"__data__":"{\"id_\":\"17882b56-8ce6-4cb7-bc95-d197f2b40962\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Resume - Sanathkumar A Swamy.pdf\",\"file_name\":\"Resume - Sanathkumar A Swamy.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{\"SOURCE\":{\"nodeId\":\"./data/Resume - Sanathkumar A Swamy.pdf_1\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Resume - Sanathkumar A Swamy.pdf\",\"file_name\":\"Resume - Sanathkumar A Swamy.pdf\"},\"hash\":\"s3LLFkFS2PHNoDeNQgC9SHoD+b7qESc1hUBpSkrj6cA=\"},\"NEXT\":{\"nodeId\":\"c927e908-7fca-46f1-9960-a6737d557597\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Resume - Sanathkumar A Swamy.pdf\",\"file_name\":\"Resume - Sanathkumar A Swamy.pdf\"},\"hash\":\"NUHAgPQ+Sm/coMNAe+tY86B8BWNzfgMbtycghJTEUDM=\"}},\"text\":\"Address: 1 Miranda Close, Clayton South VIC 3169                                                                            GitHub: https://github.com/sanathkumar5671\\r\\nPhone No: +61 432062190                                                                                 LinkedIn: https://www.linkedin.com/in/sanathkumar-a-990549136\\r\\nEmail Id:sanathkumar5671@gmail.com                                                                                        Personal Website: https://sanathkumar.netlify.app\\r\\nSanathkumar A Swamy\\r\\nPERSONAL STATEMENT\\r\\nA   passionate   and   detail-oriented   computer   science   graduate   with   a   strong   academic   foundation   and   two   years   of\\r\\nprofessional experience as a software development engineer. Proficient in a wide range of programming languages and\\r\\ntechnologies, with a focus on  efficient and secure coding practices, effective interpersonal communication skills and\\r\\nbuilding scalable & robust application  . Eager   to   leverage   my   problem   solving   skills   to   contribute   to   an   innovative\\r\\norganization's growth and success. SKILLS\\r\\nProgramming Languages: (Expert) Python, Javascript (Intermediate) PHP, Structured Query Language (SQL), (beginner) C++\\r\\nDevelopment Tools:  (Expert) React.js, (Intermediate) HTML, CSS, Node.js, Express.js, CodeIgniter, Django, Docker,\\r\\nNginx, Microsoft Azure, Git, MongoDB, MySql, PostreSQL, HTTP, RESTful API, Postgres, React and Redux, jquery\\r\\nDevelopment Methodologies: System Development Life Cycle, Agile, Jira, Git, Confluence\\r\\nSoft Skills: Problem Solving, Collaboration, Communication, Proactivity\\r\\nEXPERIENCE\\r\\nCo-Founder | Swamy&Co                                                         February 2023 -  March 2024\\r\\n•Acquired 2 clients from hospitality sector within the first six months of launching a consulting firm called Swamy&Co. •Developing innovative solutions to address market needs or challenges faced by the clients. Implementing  efficient\\r\\ntechnologies to streamline operations and drive growth for our clients. •Collaborated with the clients to understand their challenges and devise a tailored solution. Utilized MERN stack and\\r\\nLaravel to build a scalable and efficient system capable of handling increased user demand. •Implemented financial management features resulting in a 10% reduction in monthly losses for the clients.\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"TEXT\",\"hash\":\"Vc+pfxVJsmsIDJeoA6GlL/M3759r6GYymuL+PyS2EUU=\"}","__type__":"TEXT"},"c927e908-7fca-46f1-9960-a6737d557597":{"__data__":"{\"id_\":\"c927e908-7fca-46f1-9960-a6737d557597\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Resume - Sanathkumar A Swamy.pdf\",\"file_name\":\"Resume - Sanathkumar A Swamy.pdf\"},\"excludedEmbedMetadataKeys\":[],\"excludedLlmMetadataKeys\":[],\"relationships\":{\"SOURCE\":{\"nodeId\":\"./data/Resume - Sanathkumar A Swamy.pdf_1\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Resume - Sanathkumar A Swamy.pdf\",\"file_name\":\"Resume - Sanathkumar A Swamy.pdf\"},\"hash\":\"s3LLFkFS2PHNoDeNQgC9SHoD+b7qESc1hUBpSkrj6cA=\"},\"PREVIOUS\":{\"nodeId\":\"17882b56-8ce6-4cb7-bc95-d197f2b40962\",\"metadata\":{\"page_number\":1,\"file_path\":\"D:\\\\Desktop\\\\OpenAIResumeProject\\\\my-resume\\\\data\\\\Resume - Sanathkumar A Swamy.pdf\",\"file_name\":\"Resume - Sanathkumar A Swamy.pdf\"},\"hash\":\"Vc+pfxVJsmsIDJeoA6GlL/M3759r6GYymuL+PyS2EUU=\"}},\"text\":\"•Implemented financial management features resulting in a 10% reduction in monthly losses for the clients. Software Development Engineer | AMOG Consulting                                                        March 2022 – December 2022\\r\\nSmart Mooring Integrity Checker (Single-page web application)\\r\\n•Led the enhancement and implementation of features to the highly scalable and responsive web application. •Achieved a 20% improvement in user experience and a 90% positive client rating. •Integrated UI with Azure Active Directory cloud services, implementing Single Sign On (OAuth2.0 and OpenID) for\\r\\nsecure client/user interaction. •Conducted rigorous static application security testing, addressing critical vulnerabilities and improving application\\r\\nsecurity by 100%. •Implemented comprehensive unit testing strategies for diverse backend components of the application, ensuring 100%\\r\\ncode coverage through proficient utilization of pytest (python automation). •Collaborated in an  Agile  environment, developing features for the company’s performance management application\\r\\nusing CodeIgniter (PHP) and MySQL (SQL). Software Developer | Blue Square Tech Solutions                                    December 2021 -  March 2022\\r\\n•Enhanced and implemented features for the company’s WordPress-based website, effectively utilizing WordPress and\\r\\nReact.js (Javascript). •Designed and Developed a secure room booking platform using WordPress and Express.js (Javascript), customizing\\r\\nWordPress plugins based on client system requirements. •Utilized strong interpersonal skills to communicate with clients, categorize customer issues using Jira Software, and\\r\\ndevise effective solutions. •Documented design and planning using Confluence to ensure project execution. EDUCATION\\r\\nThe University of Melbourne | Master of Computer Science                                                    March 2020 – December 2021\\r\\nWAM – 74/100                                                                                                                                                  \\r\\nChrist University | Bachelors of Technology in Computer Science                                             June 2015 – May 2019\\r\\nGPA – 8.09/10\\r\\nAWARDS & CERTIFICATES\\r\\n•Award: Melbourne School of Engineering Scholarship [AUD$5000]. •Publication:Secure Bitcoin Transaction and IoT Device usage in Decentralized Application.\",\"textTemplate\":\"\",\"metadataSeparator\":\"\\n\",\"type\":\"TEXT\",\"hash\":\"NUHAgPQ+Sm/coMNAe+tY86B8BWNzfgMbtycghJTEUDM=\"}","__type__":"TEXT"}},"docstore/metadata":{"./data/Career Journey.pdf_1":{"docHash":"j7uhbOxjsyJ18KRZsbqFwDMcFrTn6fSR+dE5Yu9ov9M="},"./data/Career Journey.pdf_2":{"docHash":"3WmxzvcGbCFjmqoh+BNPX8OLVOFjByyDv7CkmXMZxNE="},"./data/Career Journey.pdf_3":{"docHash":"nwfpYQXsGhRQsfTrxfXZjOVm6AlSRUJRHqM9/UrdAUg="},"./data/Career Journey.pdf_4":{"docHash":"E4DK+l2P7nvw5uqGFI76nawW8ADkXSvaL72FFLQSAZs="},"./data/Resume - Sanathkumar A Swamy.pdf_1":{"docHash":"s3LLFkFS2PHNoDeNQgC9SHoD+b7qESc1hUBpSkrj6cA="},"./data/Resume - Sanathkumar A Swamy.pdf_2":{"docHash":"E4DK+l2P7nvw5uqGFI76nawW8ADkXSvaL72FFLQSAZs="},"1aa7fd63-b1b7-4035-bfb2-b93d38b1c09a":{"docHash":"3Z9rYmSC9L5bVd72O27pzEkNF/MLdNoB4W7a9qFQ4bg=","refDocId":"./data/Career Journey.pdf_1"},"f945dc0c-91ec-4b51-8c1a-55ab2f644128":{"docHash":"Saa6/wdrMZ9+a5Us7xyB2cHpxISZ+EVeI5Fcbo8Cg44=","refDocId":"./data/Career Journey.pdf_1"},"e68151cb-1131-4cfb-b5b7-8a5f599a0eba":{"docHash":"bwAyURsUz67i3EShJ8u+OxaYt5zUBFllYRnOcf8ynAU=","refDocId":"./data/Career Journey.pdf_2"},"91ba3142-d732-4177-ab3d-e92c83ce1801":{"docHash":"69UliaWNBfErvUkMOg3aaj5VMg7Y4C+j5pDfKV2Q9IM=","refDocId":"./data/Career Journey.pdf_2"},"79a03803-3457-43cc-839c-516925f67207":{"docHash":"DYhUAByXv1tA3rboDDBiVFX+z0y3Rv39RI7l8Y/j4lQ=","refDocId":"./data/Career Journey.pdf_3"},"17882b56-8ce6-4cb7-bc95-d197f2b40962":{"docHash":"Vc+pfxVJsmsIDJeoA6GlL/M3759r6GYymuL+PyS2EUU=","refDocId":"./data/Resume - Sanathkumar A Swamy.pdf_1"},"c927e908-7fca-46f1-9960-a6737d557597":{"docHash":"NUHAgPQ+Sm/coMNAe+tY86B8BWNzfgMbtycghJTEUDM=","refDocId":"./data/Resume - Sanathkumar A Swamy.pdf_1"}},"docstore/ref_doc_info":{"./data/Career Journey.pdf_1":{"nodeIds":["1aa7fd63-b1b7-4035-bfb2-b93d38b1c09a","f945dc0c-91ec-4b51-8c1a-55ab2f644128"],"extraInfo":{}},"./data/Career Journey.pdf_2":{"nodeIds":["e68151cb-1131-4cfb-b5b7-8a5f599a0eba","91ba3142-d732-4177-ab3d-e92c83ce1801"],"extraInfo":{}},"./data/Career Journey.pdf_3":{"nodeIds":["79a03803-3457-43cc-839c-516925f67207"],"extraInfo":{}},"./data/Resume - Sanathkumar A Swamy.pdf_1":{"nodeIds":["17882b56-8ce6-4cb7-bc95-d197f2b40962","c927e908-7fca-46f1-9960-a6737d557597"],"extraInfo":{}}}}