{"docstore/data":{"a542f48c-0b35-4345-bfc6-e564931828e9":{"indexId":"a542f48c-0b35-4345-bfc6-e564931828e9","nodesDict":{"b5608e1e-acdc-4722-ae4d-bbac3f5ac2c3":{"id_":"b5608e1e-acdc-4722-ae4d-bbac3f5ac2c3","metadata":{"page_number":1,"file_path":"D:\\Desktop\\interactiveResume2\\data\\Sanathkumar_Career_Journey_Story.pdf","file_name":"Sanathkumar_Career_Journey_Story.pdf"},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Sanathkumar_Career_Journey_Story.pdf_1","metadata":{"page_number":1,"file_path":"D:\\Desktop\\interactiveResume2\\data\\Sanathkumar_Career_Journey_Story.pdf","file_name":"Sanathkumar_Career_Journey_Story.pdf"},"hash":"V6qU0GHn0ZSslZo/ah//4vdyOwR1upFHBgPm69GuIKo="}},"text":"Sanathkumar A Swamy - Resume and Career Journey\r\nSanath's Career Journey: A Story\r\nSanathkumar A Swamy's journey into the world of computer science began unexpectedly\r\nduring Year 12 when he found himself engrossed in building a website for a school\r\nassignment. Despite having average grades in other science subjects, his computer science\r\nmarks stood out, igniting a passion for understanding the intricacies of programming\r\nlanguages such as JavaScript, HTML, CSS, and C++. This early curiosity, coupled with\r\nadvice from elders, led him to pursue a Bachelor's degree in Computer Science at Christ\r\nUniversity, a prestigious institution in India. Throughout his undergraduate studies, Sanath dedicated himself to mastering challenging\r\nconcepts in engineering mathematics and theoretical subjects like Database Management,\r\nSoftware Engineering, Data Structures, and Algorithms. His hard work paid off when, in his\r\nthird year, he published a research paper titled \"Secure Bitcoin Transaction and IoT Device\r\nUsage in Decentralized Application\" and developed a smart door lock system using\r\nblockchain technology for his final year project. Eager to stay on the cutting edge of technology, Sanath explored various frameworks and\r\ntools, including Laravel, Django, MongoDB, and ReactJS, often creating innovative projects\r\nlike a smart stick for blind people, designed to help them navigate public places. Upon graduating with a GPA of 8.09, Sanath began his professional career as a volunteer\r\nData Analyst at BR & UD Trust, where he analyzed geospatial data to help rural communities\r\naccess sustainable electricity and water. His work there involved using tools like Tableau,\r\nPage 1","textTemplate":"","metadataSeparator":"\n","type":"TEXT","hash":"qvpSB0GotAezwLNsFW0/SjnN4gtpbt0aONDyHaRq+Io="},"402b1e15-79e8-413b-b439-37e9e2b76115":{"id_":"402b1e15-79e8-413b-b439-37e9e2b76115","metadata":{"page_number":2,"file_path":"D:\\Desktop\\interactiveResume2\\data\\Sanathkumar_Career_Journey_Story.pdf","file_name":"Sanathkumar_Career_Journey_Story.pdf"},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Sanathkumar_Career_Journey_Story.pdf_2","metadata":{"page_number":2,"file_path":"D:\\Desktop\\interactiveResume2\\data\\Sanathkumar_Career_Journey_Story.pdf","file_name":"Sanathkumar_Career_Journey_Story.pdf"},"hash":"MsoSbvIxlC9+bTx2x7LkzXXAjPOuOTX2pVtmnNTzlMk="}},"text":"Sanathkumar A Swamy - Resume and Career Journey\r\nMap Box, Python, and JavaScript to clean and visualize data. Sanath's academic journey continued when he received an offer with a scholarship from the\r\nUniversity of Melbourne. There, he delved into subjects like software testing, web security,\r\nadvanced database management, distributed computing, and machine learning. He\r\ncompleted his Master's degree with a research project on detecting deepfake videos and\r\ntheir impact on social media, earning a WAM of 74. After his Master's, Sanath joined Blue Square Tech Solutions in Melbourne as a software\r\ndeveloper. He quickly adapted to the fast-paced startup environment, fixing bugs, building\r\nfront-end components, and creating secure room booking platforms using JavaScript,\r\nNextJS, WordPress, and MongoDB. His experience there honed his client-handling skills and\r\ndeepened his understanding of the system development life cycle. Sanath's next move was to AMOG Consulting, a prestigious consulting firm in Australia. As a\r\nGraduate Software Engineer, he worked on enhancing web applications, integrating security\r\nfeatures, and developing new functionalities using ReactJS and Flask. His projects included\r\ncreating multiple React components, Flask-RESTful APIs, and performing static application\r\nsecurity testing, achieving 90% code coverage with Python-based unit tests. In 2023, Sanath returned to India after spending over three years in Australia. After a brief\r\ncareer break to improve his coding skills in C++ and algorithms, he started working as a\r\nfreelance software developer. He acquired clients in the hospitality sector, building full-stack\r\napplications and eventually co-founding Swamy&Co with his sibling to help small\r\nbusinesses improve their operations. Page 2","textTemplate":"","metadataSeparator":"\n","type":"TEXT","hash":"g2DpkRVk4giHchlfAV58A/au03iUbH2aEfIEa+czndM="},"06a2c04f-aedc-472b-bbcc-a154550dbb6e":{"id_":"06a2c04f-aedc-472b-bbcc-a154550dbb6e","metadata":{"page_number":3,"file_path":"D:\\Desktop\\interactiveResume2\\data\\Sanathkumar_Career_Journey_Story.pdf","file_name":"Sanathkumar_Career_Journey_Story.pdf"},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Sanathkumar_Career_Journey_Story.pdf_3","metadata":{"page_number":3,"file_path":"D:\\Desktop\\interactiveResume2\\data\\Sanathkumar_Career_Journey_Story.pdf","file_name":"Sanathkumar_Career_Journey_Story.pdf"},"hash":"q8nul4TR+TFQh+JBIr+gj/S/ovNkgEM0v9hhs1b3cuA="}},"text":"Sanathkumar A Swamy - Resume and Career Journey\r\nCurrently, Sanath is a Back-end Developer at KOIS AI, where he builds back-end applications\r\nusing Node.js, Express.js, MongoDB, and AWS, and ensures comprehensive web application\r\ntesting for functionality and security. Throughout his career, Sanath has also earned several awards and certifications, including\r\nthe Melbourne School of Engineering Scholarship (AUD$5000) and certifications like the Jira\r\nFundamental Badge, Confluence Fundamental Badge, and Azure Fundamental Certification\r\n(AZ-900). Today, Sanath is open for new opportunities, ready to bring his extensive knowledge and\r\nskills to a forward-thinking organization. His journey is a testament to his passion,\r\ncontinuous learning, and adaptability in the ever-evolving field of computer science. If you\r\nbelieve Sanath could be a good fit for your organization, please reach out to him at\r\nsanathkumar5671@gmail.com or call him at +61 432062190. Page 3","textTemplate":"","metadataSeparator":"\n","type":"TEXT","hash":"myvyLrGl/ezrChnx/Td/mO7Tn3A3wisXapVOiXyL2qk="}},"type":"simple_dict"}}}